load-test-login.yml

config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 50
      rampTo: 100
      name: Warm up
    - duration: 120
      arrivalRate: 100
      name: Sustained load (100 req/s)
  defaults:
    headers:
      Content-Type: "application/json"
scenarios:
  - name: "Login flow"
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
payload:
  path: "users.csv"
  fields:
    - "email"
    - "password"
  order: "random"