load-test-products-v3.yml

config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 50
      rampTo: 100
      name: Warm up
    - duration: 60
      arrivalRate: 500
      name: Target load (approx 500 concurrent)
scenarios:
  - name: "Get products"
    flow:
      - get:
          url: "/products"